//1.Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

let numbers = '';
for(let i=20; i <= 30; i = i+0.5) {
   numbers += i + ' ';
}
console.log(numbers);

//2.Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

for(let i=10; i<=100; i = i+10) {
    console.log(`Вартість ${i} долларів становить ${i*27} гривень`);
}
//3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

let n = 70;
let result = [];
for(let i = 1; i<=100; i++){
    if(i*i <= n) {
        result.push(i);
    }
}
console.log (`Цілі числа від 1 до 100, квадрат яких не перевищує числа ${n} : ${result}`);

//4.Дане ціле число.
// З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

function isPrime (x) {
    if( x > 1) {
        for(let i=2; i < x; i++) {
            if(x % i === 0){
                return 'Задане число не є простим';
            }
        }
        return 'Задане число є простим';
    } else {
        return 'Число має бути більше 1';
    }
}

console.log(isPrime(9));

//5.Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь.
// (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

function myFunc (num) {
    while(num % 3 === 0) {
        num /= 3;
    }
    if (num === 1) {
        return 'Це число можна одержати шляхом зведення числа 3 у деякий ступінь';
    }

    return 'Це число НЕ можна одержати шляхом зведення числа 3 у деякий ступінь';
}

console.log (myFunc(9));